app/controllers/friends_controller.rb

SELECT `friends`.* FROM `friends`
---
  def index
    @friends = Friend.all

INSERT INTO `friends` (`first_name`, `last_name`, `email`, `phone`, `twitter`, `created_at`, `updated_at`) VALUES ('Othon', 'Maranhão', 'othonb@yahoo.com', '+5583996948841', '@profothon', '2021-12-23 22:19:17.251323', '2021-12-23 22:19:17.251323')
---
  def create
    @friend = Friend.new(friend_params)

    respond_to do |format|
      if @friend.save

UPDATE `friends` SET `friends`.`email` = 'othonb@yahoo.com', `friends`.`updated_at` = '2021-12-27 21:28:57.005733' WHERE `friends`.`id` = 13
---
  def update
    respond_to do |format|
      if @friend.update(friend_params)

DELETE FROM `friends` WHERE `friends`.`id` = 2
---
  def destroy
    @friend.destroy

SELECT `friends`.* FROM `friends` WHERE `friends`.`id` = 1 LIMIT 1
---
    def set_friend
      @friend = Friend.find(params[:id])